Autodesk.Revit.UI.Selection.SelectableInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of an SelectableInViewFilter, with the option to pass all non-selectable elements.
document:
The document that owns the view.
viewId:
The view id.
inverted:
True if the filter should match all elements not selectable in the given view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.UI.Selection.SelectableInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of an SelectableInViewFilter.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015